---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d
source: html/8afb2aa7-6f31-1729-1256-3c9b03aadc3e.htm
---
# AssetPropertyDoubleArray2d Members

Adds a new connected asset attached to this asset property, if it allows it.